---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotHaveDiffThickness
source: html/69e99bb2-78d2-d3e0-af2e-71084838b771.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotHaveDiffThickness Property

This infilling element must have the same thickness as its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId InfillCannotHaveDiffThickness { get; }
```